---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightOffset
source: html/a9057cde-e5c5-6d7f-a2bf-4b3b7438232d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofCurveHeightOffset Property

"Offset From Roof Base"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofCurveHeightOffset { get; }
```